app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function show($id = null)
    {
        $model = new UserModel();
        $data['user'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'

    public function create()
    {
        $model = new UserModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'type' => $this->request->getPost('type'),
        ];
        $model->save($data);
---
INSERT INTO `users` (`name`, `type`) VALUES ('aali', 'admin')

    public function edit($id = null)
    {
        $model = new UserModel();
        $data['user'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function delete($id = null)
    {
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('2')